ATsupportum/src/InformationRegisters/СвойстваЗаданий_ат/СвойстваЗаданий_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СвойстваЗаданий_ат</name>
  <resources>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсключатьИзРезультатаЗаявки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Краткосрочное</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ОтчетнаяДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ОтчетнаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Удалить_ОтчетнаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Удалить_ОтчетноеВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемоеВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порог1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Порог2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатВыполнения</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>РезультатВыполненияВHTML</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ФактическаяДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ФактическаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическоеВремяВыполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПерезапускЭкземпляраПродукта</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>DocumentRef.Задание_ат</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/InformationRegisters/СвойстваЗаданий_ат/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Запись.АвторИзменения		= Пользователи.ТекущийПользователь();
		Запись.ДатаИзменения		= ТекущаяДатаСеанса();
		Запись.РезультатВыполнения	= Взаимодействия.ПолучитьОбычныйТекстИзHTML(Запись.РезультатВыполненияВHTML);
		
		Если НЕ РаботаСHTML_КлиентСервер_ат.ТекстЯвляетсяТекстомHTML(Запись.РезультатВыполненияВHTML) Тогда
			
			Запись.РезультатВыполненияВHTML = РаботаСHTML_КлиентСервер_ат.ПреобразоватьОбычныйТекстВHTML(Запись.РезультатВыполненияВHTML);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
